[
  {
    "quote": "Allah tidak akan pernah membebani seseorang melainkan sesuai dengan kesanggupannya.",
    "reference": "Q.S. Al-Baqarah (2:286)"
  },
  {
    "quote": "Dan janganlah kamu merasa lemah, dan jangan pula (kamu merasa) bersedih hati. Sebab, kamu paling tinggi derajatnya jika kamu (termasuk) orang yang beriman.",
    "reference": "Q.S. Al-Imran (3:139)"
  },
  {
    "quote": "Dan Dia Allah akan memberi manusia rezeki dari arah yang tak disangka-sangka. Dan barangsiapa yang bertawakal kepada Allah, niscaya Allah 'kan cukupkan (keperluan)nya. Sungguh, Allah melaksanakan urusan-Nya (menepati janji-Nya).",
    "reference": "Q.S At-Talaq (65:3)"
  },
  {
    "quote": "Wahai orang-orang yang beriman! Mohonlah pertolongan kepada Allah dengan sabar dan shalat. Sungguh, Allah (akan selalu) bersama orang-orang yang sabar.",
    "reference": "Q.S Al-Baqarah (2:153)"
  },
  {
    "quote": "Juallah kehidupanmu saat ini untuk kehidupanmu selanjutnya, akhirat, niscaya kamu akan mendapatkan keduanya. Tetapi, jika kamu menjual kehidupan selanjutnya untuk kehidupan saat ini, maka kamu akan kehilangan keduanya.",
    "reference": "Hasan Al-Basri"
  },
  {
    "quote": "Dunia ini ibarat bayangan. Jika kamu berusaha menangkapnya, dia akan lari. Tetapi, jika kamu membelakanginya, maka dia tak punya pilihan selain untuk mengikutimu.",
    "reference": "Ibnu Qayyim"
  },
  {
    "quote": "Keikhlasan adalah rahasia antara Allah dengan hamba-Nya. Bahkan, malaikat pencatat pun tidak dapat mengetahui hal itu barang sedikit guna dituliskannya dalam catatan amal. Setan juga tidak mengetahui sehingga dia tidak bisa merusaknya, nafsu pun tidak menyadari sehingga ia tidak bisa mempengaruhinya.",
    "reference": "Junayd Al-Baghdadi"
  },
  {
    "quote": "Terkadang Allah akan membiarkanmu merasakan pahitnya kehidupan dunia, sehingga kamu dapat menghargai dan mencicipi manisnya iman.",
    "reference": "Omar Suleiman"
  },
  {
    "quote": "Nasibmu telah ditulis oleh tinta cinta-Nya. Kemudian disegel dengan rahmat-Nya. Jadi tak perlu takut, percayakanlah dirimu kepada-Nya dan berharaplah pada segala ketetapan-Nya.",
    "reference": "Gems of Jannah"
  },
  {
    "quote": "Allah selalu menjawab doamu dengan tiga cara. Pertama, langsung mengabulkannya. Kedua, menundanya. Ketiga, menggantinya dengan yang lebih baik untukmu.",
    "reference": "Anonim"
  },
  {
    "quote": "Jika apa yang kamu harapkan tidak terjadi, maka kamu harus mencoba untuk menyukai apa-apa yang sedang terjadi.",
    "reference": "Anonim"
  },
  {
    "quote": "Takutlah pada Allah karena hukumannya. Cintai Dia, karena Allah sangat penuh dengan belas kasihan.",
    "reference": "Anonim"
  },
  {
    "quote": "Allah menjadikanmu seorang Muslim karena ingin melihatmu berada di surga-Nya. Dan yang perlu kamu lakukan adalah menunjukkan jika kamu pantas untuk itu.",
    "reference": "Anonim"
  },
  {
    "quote": "Setiap kamu akan tidur, cobalah untuk mulai merenung. Apakah langkahmu hari ini sudah membuatmu semakin dekat dengan Allah? Atau malah sebaliknya, membuatmu semakin jauh dari Allah?",
    "reference": "Anonim"
  },
  {
    "quote": "Ketika rasa sakit hatimu membuatmu jatuh, ingatlah Allah melihat semuanya dan sedang merencanakan hal baik lainnya.",
    "reference": "Anonim"
  },
  {
    "quote": "Petunjuk tidak bisa dicapai kecuali oleh pengetahuan. Dan, arah tujuan yang benar tidak akan bisa dituju kecuali dengan kesabaran.",
    "reference": "Anonim"
  },
  {
    "quote": "Teruslah berusaha dengan harapan apa yang kamu impikan. Dan janganlah lupa untuk mendampingi usaha tersebut dengan kesabaran serta keikhlasan.",
    "reference": "Anonim"
  },
  {
    "quote": "Setelah kamu memohon bimbingan menuju jalan yang lurus kepada Allah, maka jangan hanya berdiri di tempat. Mulailah melangkah.",
    "reference": "Anonim"
  },
  {
    "quote": "Definisi dari kata kuat itu bukan berarti tidak pernah dan tidak boleh menangis. Tetapi, orang yang kuat itu adalah orang yang terus beristikamah di jalan Allah ketika menghadapi segala ujian dan godaan.",
    "reference": "Anonim"
  },
  {
    "quote": "Maka sesungguhnya bersama kesulitan ada kemudahan.",
    "reference": "Q.S Al-insyirah (94:5)"
  },
  {
    "quote": "Dan sesungguhnya, Allah itu bersama orang-orang yang (senang) berbuat baik.",
    "reference": "Q.S Al-Ankabut (29:69)"
  },
  {
    "quote": "Dan tidak ada satu pun makhluk bergerak (bernyawa) di muka bumi ini melainkan semuanya (telah) dijamin Allah rezekinya. Dia mengetahui tempat kediamannya dan tempat penyimpanannya. Semuanya (ada) dalam Kitab yang nyata (Lauhul Mahfuz).",
    "reference": "Q.S Hud (11:6)"
  },
  {
    "quote": "Ketika kita ingin memperbaiki hubungan kita dengan Allah, maka percayalah jika Dia akan memperbaiki semua hal yang lain untuk kita. Jika kamu ingin menghancurkan suatu negara tanpa perang, maka berbuatlah perzinahan & ketelanjangan umum di generasi berikutnya.",
    "reference": "Salahuddin Ayyubi"
  },
  {
    "quote": "Percayalah kepada Allah ketika segala sesuatunya tidak berjalan seperti yang kamu inginkan. Allah punya rencana yang lebih baik untukmu. Lidah seseorang itu bisa memberimu rasa hati yang sesungguhnya.",
    "reference": "Ibnu Qayyim"
  },
  {
    "quote": "Kamu tidak boleh membiarkan hatimu merasakan kesenangan yang berlebih hanya karena pujian dari orang lain. Kamu akan merasa sedih jika kecaman datang dari mereka suatu hari nanti.",
    "reference": "Imam Ghazali"
  },
  {
    "quote": "Jika kamu mencintai seseorang, biarkan dia pergi. Jika ia kembali, maka ia milikmu. Namun jika tidak, maka ketahuilah jika dia bukan milikmu.",
    "reference": "Ali bin Abi Thalib"
  },
  {
    "quote": "Arti ikhlas ialah melupakan pujian dari manusia dan terus berusaha untuk mencari rida dari Sang Pencipta. Barang siapa yang di hadapan manusia menghiasi diri dengan suatu hal yang tidak dia miliki, maka ia telah jauh dari rahmat Allah.",
    "reference": "Ibnu Al-Qayyim"
  },
  {
    "quote": "Tidak ada solusi yang lebih baik bagi dua insan yang saling mencintai dibanding pernikahan.",
    "reference": "H.R. Ibnu Majah"
  },
  {
    "quote": "Mencintai makhluk itu sangat berpeluang mengalami kehilangan. Kebersamaan bersama makhluk juga berpeluang mengalami perpisahan. Hanya cinta kepada Allah yang tidak akan membuatmu kehilangan.",
    "reference": "Habiburrahman El Shirazy"
  },
  {
    "quote": "Tidak perlu berduka. Apa pun yang hilang dari dirimu, pasti akan kembali lagi dalam wujud yang lain.",
    "reference": "Jalaluddin Rumi"
  },
  {
    "quote": "Penderitaan adalah anugerah. Di dalamnya tersembunyi belas kasihan Tuhan semesta alam.",
    "reference": "Jalaluddin"
  },
  {
    "quote": "Aku sangat amat percaya. Hanya cinta dari Tuhanku Allah lah yang akan membuat semua sakitku sembuh.",
    "reference": "Anonim"
  },
  {
    "quote": "Alangkah baiknya jika kamu tidak membiarkan perasaan cinta yang kamu miliki membuat kamu menjadi terikat padanya. Jangan pula kamu membiarkan rasa benci menguasaimu dan berbuat kehancuran.",
    "reference": "Anonim"
  },
  {
    "quote": "Pada setiap malam sebelum tidur, maafkanlah semua orang. Lalu, tidurlah dengan hati yang bersih.",
    "reference": "Anonim"
  },
  {
    "quote": "Jangan hanya berterima kasih kepada Allah ketika semuanya berjalan baik dan sesuai keinginanmu. Terima kasih lah kepada-Nya bahkan ketika segala sesuatunya terasa sulit.",
    "reference": "Anonim"
  },
  {
    "quote": "Allah merupakan tempat hamba-Nya berserah diri. Kita juga dapat memohon untuk meminta bantuan kepada-Nya. Agama Islam ini mengajari kita banyak doa-doa untuk berbagai hal, termasuk mengatasi kesedihan.",
    "reference": "Anonim"
  },
  {
    "quote": "Percayalah pada garis ketentuan takdir-Nya. Dia, Allah, adalah penulis skenario terbaik, dia juga yang tahu kapan sesuatu itu menjadi baik untuk kita.",
    "reference": "Anonim"
  },
  {
    "quote": "Ucapkanlah kata syukur, Alhamdulillah, maka kamu akan jauh dari kufur.",
    "reference": "Anonim"
  },
  {
    "quote": "Jika bukan Allah yang membersamai langkah dari kaki kecilku ini, mungkin aku bukan apa-apa. Dialah yang mempermudah urusan dan memenuhi kebutuhan.",
    "reference": "Anonim"
  },
  {
    "quote": "Jangan berhenti berdoa yang terbaik bagi orang yang kau cintai.",
    "reference": "Ali bin Abi Thalib"
  },
  {
    "quote": "Lebih baik kehilangan sesuatu demi Tuhan. Daripada harus kehilangan Tuhan hanya demi mendapatkan sesuatu.",
    "reference": "Mufti Menk"
  },
  {
    "quote": "Berdoalah kepada Allah, niscaya pasti Dia mendengarnya. Karena dialah yang Maha Mendengar hati manusia.",
    "reference": "Anonim"
  },
  {
    "quote": "Jika kamu pikir kekayaan hanya tentang harta dan jumlah yang dipunya, maka itu merupakan kekeliruan yang besar. Orang yang paling kaya adalah mereka yang tidak akan membiarkan dirinya jatuh pada keserakahan.",
    "reference": "Anonim"
  },
  {
    "quote": "Hati itu ibaratnya seperti sebuah cangkir. Ketika kamu mengisinya dengan kecintaan pada Allah, maka kamu akan semakin memperkecil ruang untuk rasa cinta kepada dunia.",
    "reference": "Anonim"
  },
  {
    "quote": "Mengubah takdir untuk Allah sangatlah mudah. Mudah sekali, seperti memutarkan telapak tanganmu. Dia dapat dengan mudah mengubah masa terberatmu menjadi waktu terbaik untuk bangkit.",
    "reference": "Anonim"
  },
  {
    "quote": "Saat aku sudah memilih jalanku, jalan menuju surga-Nya. Memilih untuk lebih dekat dengan sang Khaliq. Maka aku tidak akan membiarkan siapapun, apapun, dan bagaimanapun membuatku menyerah.",
    "reference": "Anonim"
  },
  {
    "quote": "Hal yang akan aku perbaiki adalah cara aku mengambil keputusan dalam menghadapi masalah. Aku tidak akan terus bersantai dan mengandalkan imaji. Karena itu akan menjadi titik awal hatiku merasakan cemas, resah, dan gelisah.",
    "reference": "Anonim"
  },
  {
    "quote": "Tidak ada manusia dengan sifat-sifat kesempurnaan sejak lahir. Tetapi Allah menyelamatkan dan memberikan kita kehormatan melalui agama Islam.",
    "reference": "Anonim"
  },
  {
    "quote": "Aku punya banyak hal yang harus aku syukuri. Aku sehat, bahagia, dan penuh cinta dari Allah. Alhamdulillah",
    "reference": "Anonim"
  },
  {
    "quote": "Berdoalah setiap waktu dan jadikan itu sebagai kebiasaan. Maka yakinlah, kedepannya kesuksesan akan menjadi gaya hidup yang paling kau syukuri.",
    "reference": "Anonim"
  },
  {
    "quote": "Penggemar dari seorang penulis datang saat orang-orang telah mempelajari karyanya. Hal ini juga bekerja pada kehidupan. Ketika kamu memilih membaca Al-qur’an, maka kamu akan semakin mencintai Penulisnya.",
    "reference": "Anonim"
  },
  {
    "quote": "Jangan minder untuk mulai berbuat baik. Kamu hanya perlu untuk berjanji pada dirimu sendiri untuk tidak berhenti berbuat baik. Meski kebaikanmu diragukan dan dilupakan, maka Allah lah yang paling berhak menilaimu.",
    "reference": "Anonim"
  },
  {
    "quote": "Sungguh, Tuhan sama sekali tidak salah orang. Tetapi, orang-oranglah yang salah pada diri mereka sendiri.",
    "reference": "Anonim"
  },
  {
    "quote": "Mengapa kamu bisa dengan mudahnya menaruh harap kepada suatu makhluk, padahal kamu bisa membuat harap yang besar pada sang Maha Pencipta?",
    "reference": "Anonim"
  },
  {
    "quote": "Jika dengan berbuat salah atau dosa itu justru membuatmu merasa tidak layak atas hidayah Allah, maka itu sama saja kamu menganggap orang tidak boleh mandi karena sudah terlalu kotor.",
    "reference": "Anonim"
  },
  {
    "quote": "Bersabar terhadap orang lain laksana cinta. Bersabar terhadap diri sendiri merupakan harap, dan bersabar terhadap Allah adalah keyakinan juga kewajiban.",
    "reference": "Anonim"
  },
  {
    "quote": "Musibah bagaikan air keruh yang datang. Semakin diaduk dia, semakin keruh pula airnya. Maka tenang dan bersabarlah ketika menghadapi masalah. Karena sejatinya, sebentar lagi dia akan jernih.",
    "reference": "Anonim"
  },
  {
    "quote": "Bukan seorang teman, pacar yang amat kau cintai, atau keluargamu, yang akan setia kepadamu dan siap menerima serta senantiasa bersamamu dalam berbagai situasi sulit, kecuali Allah.",
    "reference": "Anonim"
  },
  {
    "quote": "Kita mungkin pernah disakiti oleh orang yang mencintai kita, tapi kita tidak perlu membuang tenaga dengan ikut membenci orang yang menyakiti kita. Sebaliknya, kita harus berjanji kepada diri kita sendiri bahwa selamanya kita tidak akan pernah menyakiti orang lain seperti ini.",
    "reference": "Anonim"
  }
    ]
  
